tutorials/pisoFoamHFDIB/impeller/constant/HFDIBDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
stlNames ("impeller");

interpolationSchemes
{
 U cellPointFace;
}

impeller
{
 
 rotatingBody
 {
  axis     (0 0 1);
  center   (0 0 0);
  omega    3.14;
 }
 
 U
 {
  BC  noSlip;
 }

}


// ************************************************************************* //
